var combList = new Map([
    [['风晴雪', '百里屠苏'], ['3', '与子成说']],
    [['百里屠苏', '悭臾'], ['3', '乘龙归']],
    [['百里屠苏', '欧阳少恭'], ['3', '琴心剑魄']],
    [['百里屠苏', '天墉城'], ['3', '云涌昆仑']],
    [['黑龙鳞片', '百里屠苏'], ['3', '故友赠礼']],
    [['百里屠苏', '古剑焚寂'], ['3', '焚焰血戮']],
    [['风晴雪', '尹千觞'], ['4', '陌相逢']],
    [['风晴雪', '幽都'], ['4', '幽都灵女']],
    [['风晴雪', '天鹿城'], ['4', '荒魂述']],
    [['欧阳少恭', '方兰生'], ['4', '琴川友']],
    [['琴川', '方兰生'], ['4', '望乡']],
    [['方兰生', '青玉司南佩'], ['4', '永相随']],
    [['百胜刀', '方兰生'], ['4', '无情客']],
    [['昭明', '阿阮'], ['4', '芳草心']],
    [['露草', '阿阮'], ['4', '共株生']],
    [['沈曦', '沈夜'], ['4', '三日遥']],
    [['流月城', '沈曦'], ['4', '月中生']],
    [['兔子抱枕', '沈曦'], ['4', '伴长眠']],
    [['巽芳', '欧阳少恭'], ['4', '仙山眷侣']],
    [['巽芳', '蓬莱'], ['4', '蓬莱公主']],
    [['紫榕林', '襄铃'], ['4', '故林栖']],
    [['襄铃', '青丘尘中记'], ['4', '青丘有狐']],
    [['襄铃', '红叶湖'], ['4', '清馨戏碟']],
    [['谢衣', '乐无异'], ['4', '春风雨']],
    [['长安', '乐无异'], ['4', '玉京游']],
    [['馋鸡', '乐无异'], ['4', '沧海飞尘']],
    [['谢衣', '沈夜'], ['4', '孤月寒灯']],
    [['流月城', '谢衣'], ['4', '胡不归']],
    [['谢衣', '通天之器'], ['4', '空留忆']],
    [['谢衣', '忘川'], ['4', '别破军']],
    [['谢衣', '静水湖'], ['4', '重山隐']],
    [['禺期', '红玉'], ['4', '古剑剑灵']],
    [['禺期', '昭明'], ['4', '铸剑仙师']],
    [['禺期', '无名之剑'], ['4', '历劫重生']],
    [['禺期', '古剑晗光'], ['4', '未成之剑']],
    [['悭臾', '欧阳少恭'], ['4', '榣山遗韵']],
    [['榣山', '悭臾'], ['4', '水虺醉琴']],
    [['黑龙鳞片', '悭臾'], ['4', '应龙信物']],
    [['悭臾', '赤水'], ['4', '空徊']],
    [['天墉城', '红玉'], ['4', '千古剑灵']],
    [['古剑红玉', '红玉'], ['4', '剑舞红袖']],
    [['安陆', '红玉'], ['4', '明月青霜']],
    [['尹千觞', '欧阳少恭'], ['4', '醉梦江湖']],
    [['尹千觞', '幽都'], ['4', '幽都巫咸']],
    [['欧阳少恭', '蓬莱'], ['4', '栖身之所']],
    [['欧阳少恭', '青玉坛'], ['4', '丹芷长老']],
    [['榣山', '欧阳少恭'], ['4', '故地重回']],
    [['欧阳少恭', '凤来'], ['4', '揽琴独照']],
    [['欧阳少恭', '梦魂枝'], ['4', '烂柯']],
    [['太华山', '清和真人'], ['4', '太华山人']],
    [['夏夷则', '清和真人'], ['4', '严师胜父']],
    [['夏夷则', '露草'], ['4', '待佳期']],
    [['阿翔', '百里屠苏'], ['4', '飞羽凌杀']],
    [['华月', '沈夜'], ['4', '护孤城']],
    [['流月城', '沈夜'], ['4', '永夜寒沉']],
    [['天墉城', '陵越'], ['4', '天墉掌门']],
    [['流月城', '华月'], ['4', '月之殇']],
    [['华月箜篌', '华月'], ['4', '廉贞曲']],
    [['神女墓', '巫山'], ['4', '神女静眠']],
    [['北洛', '云无月'], ['4', '静水流深']],
    [['缙云', '北洛'], ['4', '昨日影']],
    [['玄戈&霓商', '北洛'], ['4', '参商交辉']],
    [['天鹿城', '北洛'], ['4', '来日可期']],
    [['北洛', '太岁'], ['4', '杀伐之剑']],
    [['北洛', '原天柿'], ['4', '得力助手']],
    [['云无月', '白梦泽'], ['4', '独歌']],
    [['云无月', '梦魂枝'], ['4', '无梦之魇']],
    [['鄢陵', '岑缨'], ['4', '鸿雁于飞']],
    [['原天柿', '岑缨'], ['4', '一见喜']],
    [['画板', '岑缨'], ['4', '澄心若璃']],
    [['姬轩辕', '岑缨'], ['4', '吾道不孤']],
    [['姬轩辕', '嫘祖'], ['4', '昔年之乐']],
    [['姬轩辕', '有熊'], ['4', '轩辕氏']],
    [['姬轩辕', '鼎湖'], ['4', '龙去鼎湖']],
    [['缙云', '云无月'], ['4', '云本无心']],
    [['缙云', '太岁'], ['4', '千锋辟易']],
    [['巫炤', '司危'], ['4', '邃古遗幽']],
    [['半魂莲', '巫炤'], ['4', '恨生天地']],
    [['天鹿城', '玄戈&霓商'], ['4', '星坠']],
    [['天鹿', '玄戈&霓商'], ['4', '镇厄']],
    [['西陵', '嫘祖'], ['4', '烽烟锁城']],
    [['刘兄', '阳平'], ['4', '妙笔退魔']],
    [['刘兄', '青丘尘中记'], ['4', '神游狐乡']],
    [['天鹿', '天鹿城'], ['4', '却邪']],
    [['西陵', '有熊'], ['4', '人世星火']],
    [['半魂莲', '巫之国'], ['4', '天星尽摇']],
    [['半魂莲', '阳平'], ['4', '黑莲厄']],
    [['半魂莲', '无名之地'], ['4', '苏生之罪']],
    [['玉梳', '司危'], ['4', '负青丝']],
    [['夏夷则', '阿阮'], ['5', '光逐影']],
    [['巫山', '阿阮'], ['5', '山鬼']],
    [['闻人羽', '乐无异'], ['5', '比肩行']],
    [['古剑晗光', '乐无异'], ['5', '家传宝贝']],
    [['百草谷', '闻人羽'], ['5', '星海天罡']],
    [['夏夷则', '太华山'], ['5', '逸尘']],
    [['风晴雪', '焦炭', '谢衣'], ['10', '厨房功夫']],
    [['风晴雪', '尹千觞', '幽都'], ['10', '幽夜苍茫']],
    [['风晴雪', '百里屠苏', '桃花谷'], ['10', '桃花幻梦']],
    [['巫山', '露草', '阿阮'], ['10', '露草流萤']],
    [['蓬莱', '巽芳', '欧阳少恭'], ['10', '芳华如梦']],
    [['百里屠苏', '红叶湖', '襄铃'], ['10', '尾巴尖儿']],
    [['禺期', '古剑晗光', '乐无异'], ['10', '剑主之谊']],
    [['金麒麟', '闻人羽', '乐无异'], ['10', '长相忆']],
    [['夏夷则', '太华山', '清和真人'], ['10', '温茶相待']],
    [['百里屠苏', '陵越', '天墉城'], ['10', '天墉旧事']],
    [['昭明', '无名之剑', '古剑晗光'], ['10', '千年一器']],
    [['白梦泽', '北洛', '云无月'], ['10', '宿世秋']],
    [['巫之国', '北洛', '刘兄'], ['10', '玳之梦']],
    [['姬轩辕', '缙云', '有熊'], ['10', '以玉为戈']],
    [['姬轩辕', '嫘祖', '赤水'], ['10', '赤水遗珠']],
    [['缙云', '白梦泽', '云无月'], ['10', '刺荆心']],
    [['司危', '玉梳', '嫘祖'], ['10', '生辰礼']],
    [['无名之地', '西陵', '巫之国'], ['10', '巫之血']],
    [['夏夷则', '阿阮', '闻人羽', '云无月'], ['20', '蓝衫偃师记']],
    [['巫山', '露草', '阿阮', '神女墓'], ['20', '巫山神女']],
    [['谢衣', '沈夜', '沈曦', '华月'], ['20', '烈山遗族']],
    [['谢衣', '沈夜', '捐毒', '乐无异'], ['20', '往事浮沙']],
    [['昭明', '无名之剑', '古剑晗光', '禺期'], ['20', '天地熔炉']],
    [['姬轩辕', '北洛', '云无月', '岑缨'], ['20', '首山梦时书']],
    [['姬轩辕', '缙云', '鼎湖', '嫘祖'], ['20', '眠霜卧雪']],
    [['姬轩辕', '缙云', '巫炤', '嫘祖'], ['20', '故梦']],
    [['西陵', '巫炤', '司危', '嫘祖'], ['20', '西陵曲']],
    [['谢衣', '沈夜', '沈曦', '流月城', '华月'], ['40', '红月']],
    [['风晴雪', '方兰生', '百里屠苏', '红玉', '尹千觞', '襄铃'], ['60', '黑衣少侠传']],
    [['百里屠苏', '原天柿', '阿翔', '北洛', '馋鸡', '乐无异'], ['60', '携宠同行']],
    [['天鹿', '昭明', '古剑焚寂', '古剑红玉', '太岁', '无名之剑', '古剑晗光'], ['80', '古剑奇谭']]
]);


function createRecommendedComb() {
    viewportContainer.style.overflowY = 'scroll';
    for (let [key, value] of combList.entries()) {
        var comb = document.createElement('div');
        comb.classList.add('combpiece');
        viewportContainer.appendChild(comb);
        for (let i = 0; i < key.length; i++) {
            var combCard = document.createElement('div');
            combCard.classList.add('combcard');
            combCard.style.left = 10 + i * 3 + '%';
            combCard.style.zIndex = key.length - i - 1;
            combCard.style.backgroundImage = 'url(img/' + key[i] + '.jpg)';
            comb.appendChild(combCard);
        }
        var combName = document.createElement('div');
        combName.classList.add('combname');
        combName.innerHTML = value[1] + '&nbsp;&nbsp;&nbsp;' + value[0] + '分';
        var hr = document.createElement('hr');
        combName.appendChild(hr);
        comb.appendChild(combName);
        let content = '';
        for (let i = 0; i < key.length; i++) {
            var combContent = document.createElement('div');
            combContent.classList.add('combcontent');
            content += (key[i] + (i == key.length - 1 ? '' : '、'));
        }
        combContent.innerHTML = content;
        comb.appendChild(combContent);
    }
}